### Importar librerias necesarias

## EJERCICIO MÓDULO 3:

Uso de Pandas y Seaborn + algún gráfico de Plotly.
* PARTE 2: 25 % transformaciones:
    * Uso de función apply:
        * crear una columna price_iva a partir de la columna price que muestre el precio + IVA (21%)

    * Crear una nueva columna volumen combinando: x * y * z

    * Ordenar por dos columnas con sort_values():
        * tipo de corte (cut) y precio (price)

    * Agrupaciones con groupby y visualizarla
        * Agrupar por las 3 que hay de tipo categórico calculando la media, max, min por ejemplo de alguna de las numéricas: price, carat, depth

* PARTE 3: 20 % distribuciones: 

* Outliers: Visualización Q1 y Q3 y calcular límites tukey y filtrar. Sobre la columna precio.

* asimetría, curtosis y transformar datos con logaritmo o raíz cuadrada

* Discretizar la columna precio por barato, medio, caro usando la función pd.cut


* PARTE 4: 30 % visualizaciones:

* Seaborn EDAS:
    * univariantes:
        * histogramas y curvas de densidad
        * boxplot
        * countplot
    * bivariantes y multivariantes
        * scatterplot con hue, con size, con style
        * Calcular correlación con Pandas y mostrarla con seaborn
        * Hacer la correlación en un gráfico de barras para la columna 'price'
        * Crear una pivot table usando como index y columns algunas variables categóricas y como values usar el price y visualizarla con heatmap de seaborn
    * Combinarlas con:
        * hue, style, size, row, col usando un relplot
        * filtro

Domingo 19/01 23:59 fecha entrega.

* m3_nombre_apellido.ipynb

In [1]:
import pandas as pd
import seaborn as sns

## PARTE 1

### Carga del CSV con Pandas

In [2]:
df_diamonds = pd.read_csv('../Data/diamonds.csv')
df_diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53940 entries, 0 to 53939
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    53939 non-null  float64
 1   cut      53937 non-null  object
 2   color    53938 non-null  object
 3   clarity  53938 non-null  object
 4   depth    53940 non-null  float64
 5   table    53938 non-null  float64
 6   price    53938 non-null  object
 7   x        53938 non-null  object
 8   y        53939 non-null  float64
 9   z        53939 non-null  float64
dtypes: float64(5), object(5)
memory usage: 4.1+ MB

#### Informacón sobre el CSV

In [3]:
df_diamonds.describe()

              carat         depth         table             y             z
count  53939.000000  53940.000000  53938.000000  53939.000000  53939.000000
mean       0.797946     61.749405     57.457145      5.734479      3.538722
std        0.474013      1.432621      2.234521      1.142092      0.705700
min        0.200000     43.000000     43.000000      0.000000      0.000000
25%        0.400000     61.000000     56.000000      4.720000      2.910000
50%        0.700000     61.800000     57.000000      5.710000      3.530000
75%        1.040000     62.500000     59.000000      6.540000      4.040000
max        5.010000     79.000000     95.000000     58.900000     31.800000

In [4]:
df_diamonds.isna().sum()

carat      1
cut        3
color      2
clarity    2
depth      0
table      2
price      2
x          2
y          1
z          1
dtype: int64

#### Limpieza de nulos (limpiar valores NaN):
- Nulos en columnas continuas: mediana, media

In [5]:
# Columna Carat
media_carat = round(df_diamonds['carat'].mean(), 2)
print(f" La media de quilates es: {media_carat}")

 La media de quilates es: 0.8

In [6]:
df_diamonds['carat'] = df_diamonds['carat'].fillna(media_carat)
df_diamonds['carat'].isna().sum()

np.int64(0)

In [7]:
# Columna Cut
moda_cut = df_diamonds['cut'].mode()[0]
print(f" La moda de corte es: {moda_cut}")

 La moda de corte es: Ideal

In [8]:
df_diamonds['cut'] = df_diamonds['cut'].fillna(moda_cut)
df_diamonds['cut'].isna().sum()

np.int64(0)

In [9]:
# Columna Color
mediana_color = df_diamonds['color'].mode()[0]
print(f" La mediana de color es: {mediana_color}")

 La mediana de color es: G

In [10]:
df_diamonds['color'] = df_diamonds['color'].fillna(mediana_color)
df_diamonds['color'].isna().sum()

np.int64(0)

In [11]:
# Columna Clarrity
mode_clarity = df_diamonds['clarity'].mode()[0]
print(f" La mediana de claridad es: {mode_clarity}")

 La mediana de claridad es: SI1

In [12]:
# Rrelleno con un valor fijo tambien como pedia el enunciado
df_diamonds['clarity'] = df_diamonds['clarity'].fillna("Relleno")
df_diamonds['clarity'].isna().sum()

np.int64(0)

In [13]:
# Columna Table
mediana_table = round(df_diamonds['table'].mean(), 2)
print(f" La mediana del plano superior es: {mediana_table}")

 La mediana del plano superior es: 57.46

In [14]:
df_diamonds['table'] = df_diamonds['table'].fillna(mediana_table)
df_diamonds['table'].isna().sum()

np.int64(0)

In [15]:
# Columna Price
mode_price = df_diamonds['price'].mode()[0]
print(f" La moda del plano superior es: {mode_price}")

 La moda del plano superior es: 605

In [16]:
df_diamonds['price'] = df_diamonds['price'].fillna(mode_price)
df_diamonds['price'].isna().sum()

np.int64(0)

In [17]:
# Columna X
mode_x_column = df_diamonds['x'].mode()[0]
print(f" La moda de la columna X es: {mode_x_column}")

 La moda de la columna X es: 4.37

In [18]:
df_diamonds['x'] = df_diamonds['x'].fillna(mode_x_column)
df_diamonds['x'].isna().sum()

np.int64(0)

In [19]:
# Columna Y
mode_y_column = round(df_diamonds['y'].mean(), 2)
print(f" La media de la columna Y es: {mode_y_column}")

 La media de la columna Y es: 5.73

In [20]:
df_diamonds['y'] = df_diamonds['y'].fillna(mode_y_column)
df_diamonds['y'].isna().sum()

np.int64(0)

In [21]:
# Columna Z
mode_z_column = round(df_diamonds['z'].mean(), 2)
print(f" La media de la columna Y es: {mode_z_column}")

 La media de la columna Y es: 3.54

In [22]:
df_diamonds['z'] = df_diamonds['z'].fillna(mode_z_column)
df_diamonds['z'].isna().sum()

np.int64(0)

In [23]:
# Comprobamos que ya no hay nulos
df_diamonds.isna().sum()

carat      0
cut        0
color      0
clarity    0
depth      0
table      0
price      0
x          0
y          0
z          0
dtype: int64

In [24]:
# Buscamos los valores erroneos y los pasamos a nulos para despues limpiarlos
df_diamonds[df_diamonds.isin(["?"]).any(axis=1)]

       carat    cut color clarity  depth  table price     x     y     z
49222   0.56  Ideal     ?    VVS2   61.6   56.0  2081     ?  5.29  3.27
49227   0.50      ?     E    VVS2   61.7   61.0  2083  5.09  5.12  3.15
49229   0.70   Good     H     VS2   63.8   60.0     ?  5.59  5.51  3.54

In [25]:
# Comprobamos que hemos eliminado los valores "?"
df_diamonds = df_diamonds.replace("?", pd.NA)
df_diamonds[df_diamonds.isin(["?"]).any(axis=1)]

Empty DataFrame
Columns: [carat, cut, color, clarity, depth, table, price, x, y, z]
Index: []

In [26]:
# Comprobamos que despues del paso anterior tenemos 3 valores NaN en las columnas correspondientes
df_diamonds.isna().sum()

carat      0
cut        1
color      1
clarity    0
depth      0
table      0
price      1
x          1
y          0
z          0
dtype: int64

In [27]:
# Procedemos a eliminar esos nulos con los valores calculados anteriormente
df_diamonds['cut'] = df_diamonds['cut'].fillna(moda_cut)
df_diamonds['cut'].isna().sum()

np.int64(0)

In [28]:
df_diamonds['color'] = df_diamonds['color'].fillna(mediana_color)
df_diamonds['color'].isna().sum()

np.int64(0)

In [29]:
df_diamonds['price'] = df_diamonds['price'].fillna(mode_price)
df_diamonds['price'].isna().sum()

np.int64(0)

In [30]:
df_diamonds['x'] = df_diamonds['x'].fillna(mode_x_column)
df_diamonds['x'].isna().sum()

np.int64(0)

In [31]:
# Comprobamos que ya no hay nulos
df_diamonds.isna().sum()

carat      0
cut        0
color      0
clarity    0
depth      0
table      0
price      0
x          0
y          0
z          0
dtype: int64

#### Cambio de tipo de dato: .astype()
- Columna "carat" a tipo "float16"
- Columna "cut" a tipo "categorical"

In [32]:
# Comprobamos los tipo de datos actuales
df_diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53940 entries, 0 to 53939
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    53940 non-null  float64
 1   cut      53940 non-null  object
 2   color    53940 non-null  object
 3   clarity  53940 non-null  object
 4   depth    53940 non-null  float64
 5   table    53940 non-null  float64
 6   price    53940 non-null  object
 7   x        53940 non-null  object
 8   y        53940 non-null  float64
 9   z        53940 non-null  float64
dtypes: float64(5), object(5)
memory usage: 4.1+ MB

In [33]:
df_diamonds["carat"] = df_diamonds["carat"].astype("float16")
print(df_diamonds["carat"].dtypes)

float16

In [34]:
df_diamonds["cut"] = df_diamonds["cut"].astype("category")
print(df_diamonds["cut"].dtypes)

category

#### Encoding: texto a numérico
- Uso de la función get_dummies() para encoding one_hot

In [35]:
df_diamonds_encoding = pd.read_csv('../Data/diamonds.csv')

In [36]:
df_diamonds_encoding.head(2)

   carat      cut color clarity  depth  table price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0   326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0   326  3.89  3.84  2.31

In [37]:
pd.get_dummies(df_diamonds_encoding)

,carat,depth,table,y,z,cut_?,cut_Fair,cut_Good,cut_Ideal,cut_Premium,...,x_9.42,x_9.44,x_9.49,x_9.51,x_9.53,x_9.54,x_9.65,x_9.66,x_9.86,x_?
0,0.23,61.5,55.0,3.98,2.43,False,False,False,True,False,...,False,False,False,False,False,False,False,False,False,False
1,0.21,59.8,61.0,3.84,2.31,False,False,False,False,True,...,False,False,False,False,False,False,False,False,False,False
2,0.23,56.9,65.0,4.07,2.31,False,False,True,False,False,...,False,False,False,False,False,False,False,False,False,False
3,0.29,62.4,58.0,4.23,2.63,False,False,False,False,True,...,False,False,False,False,False,False,False,False,False,False
4,0.31,63.3,58.0,4.35,2.75,False,False,True,False,False,...,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
53935,0.72,60.8,57.0,5.76,3.50,False,False,False,True,False,...,False,False,False,False,False,False,False,False,False,False
53936,0.72,63.1,55.0,5.75,3.61,False,False,True,False,False,...,False,False,False,False,False,False,False,False,False,False
53937,0.70,62.8,60.0,5.68,3.56,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
53938,0.86,61.0,58.0,6.12,3.74,False,False,False,False,True,...,False,False,False,False,False,False,False,False,False,False
53939,0.75,62.2,55.0,5.87,3.64,False,False,False,True,False,...,False,False,False,False,False,False,False,False,False,False

* Uso de map para encoding ordinal para la columna cut como una nueva columna cut_int: 1, 2, 3, 4

In [38]:
# Buscamos los tipos de corte que hay
tipos_corte =  df_diamonds['cut'].unique()
tipos_corte

['Ideal', 'Premium', 'Good', 'Very Good', 'Fair']
Categories (5, object): ['Fair', 'Good', 'Ideal', 'Premium', 'Very Good']

In [39]:
# Creamos un diccionario con los numeros ordinales 
num_ordinal = {categoria: i + 1 for i, categoria in enumerate(tipos_corte)}
num_ordinal

{'Ideal': 1, 'Premium': 2, 'Good': 3, 'Very Good': 4, 'Fair': 5}

In [55]:
# Creamos la columna con los numeros ordinales
df_diamonds_encoding['cut_int'] = df_diamonds_encoding['cut'].map(num_ordinal)
print(df_diamonds_encoding)

       carat        cut color clarity  depth  table price     x     y     z  \
0       0.23      Ideal     E     SI2   61.5   55.0   326  3.95  3.98  2.43
1       0.21    Premium     E     SI1   59.8   61.0   326  3.89  3.84  2.31
2       0.23       Good     E     VS1   56.9   65.0   327  4.05  4.07  2.31
3       0.29    Premium     I     VS2   62.4   58.0   334   4.2  4.23  2.63
4       0.31       Good     J     SI2   63.3   58.0   335  4.34  4.35  2.75
...      ...        ...   ...     ...    ...    ...   ...   ...   ...   ...
53935   0.72      Ideal     D     SI1   60.8   57.0  2757  5.75  5.76  3.50
53936   0.72       Good     D     SI1   63.1   55.0  2757  5.69  5.75  3.61
53937   0.70  Very Good     D     SI1   62.8   60.0  2757  5.66  5.68  3.56
53938   0.86    Premium     H     SI2   61.0   58.0  2757  6.15  6.12  3.74
53939   0.75      Ideal     D     SI2   62.2   55.0  2757  5.83  5.87  3.64

       cut_int
0          1.0
1          2.0
2          3.0
3          2.0
4          3.0
...        ...
53935      1.0
53936      3.0
53937      4.0
53938      2.0
53939      1.0

[53940 rows x 11 columns]

## PARTE 2

#### Uso de función map o apply

In [42]:
df = pd.read_csv('../Data/iris.csv')
df.head(2)

   Largo Sepalo  Ancho Sepalo  Largo Petalo  Ancho Petalo        Clase
0           5.1           3.5           1.4           0.2  Iris-setosa
1           4.9           3.0           1.4           0.2  Iris-setosa

In [43]:
df['Clase'].value_counts()

Clase
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: count, dtype: int64

In [44]:
num_clase = {
    'Iris-setosa': 1,
    'Iris-versicolor': 2,
    'Iris-virginica': 3
}

df['Clase'] = df['Clase'].map(num_clase)
df.head()

   Largo Sepalo  Ancho Sepalo  Largo Petalo  Ancho Petalo  Clase
0           5.1           3.5           1.4           0.2      1
1           4.9           3.0           1.4           0.2      1
2           4.7           3.2           1.3           0.2      1
3           4.6           3.1           1.5           0.2      1
4           5.0           3.6           1.4           0.2      1

#### Revisar pos si hay que quitar

In [45]:
# Correlacion
correlacion = df.corr()
correlacion

              Largo Sepalo  Ancho Sepalo  Largo Petalo  Ancho Petalo     Clase
Largo Sepalo      1.000000     -0.109369      0.871754      0.817954  0.782561
Ancho Sepalo     -0.109369      1.000000     -0.420516     -0.356544 -0.419446
Largo Petalo      0.871754     -0.420516      1.000000      0.962757  0.949043
Ancho Petalo      0.817954     -0.356544      0.962757      1.000000  0.956464
Clase             0.782561     -0.419446      0.949043      0.956464  1.000000

#### Ordenar por dos columnas con sort_values()

In [46]:
df_diamonds = pd.read_csv('../Data/motogp_allriders.csv')
df_diamonds.head()

               name  victories   2nd   3rd  poles fastest_lap  world_champ
0   ROSSI Valentino         89  61.0  49.0   55.0          76          7.0
1  AGOSTINI Giacomo         68  20.0   NaN    6.0          69          8.0
2      MARQUEZ Marc         57  29.0  10.0   62.0          57          6.0
3       DOOHAN Mick         54  31.0  10.0   58.0          46          5.0
4     LORENZO Jorge         47  44.0  23.0   43.0          30          3.0

In [47]:
# Ordenado por una columna
df_diamonds.sort_values("world_champ")

                  name  victories  2nd  3rd  poles fastest_lap  world_champ
69            MIR Joan          1  4.0  6.0    NaN           1          1.0
39     LIBERATI Libero          4  3.0  1.0    NaN           1          1.0
35       UNCINI Franco          5  1.0  5.0    1.0           1          1.0
33       GRAHAM Leslie          5  3.0  NaN    NaN           6          1.0
30   LUCCHINELLI Marco          6  7.0  6.0    9.0           9          1.0
..                 ...        ...  ...  ...    ...         ...          ...
110    FRUTSCHI Michel          1  NaN  NaN    NaN           1          NaN
111      CZIHAK Edmund          1  NaN  NaN    NaN           1          NaN
112   COLNAGO Giuseppe          1  NaN  NaN    NaN         NaN          NaN
113                NaN          1  NaN  NaN    NaN         NaN          NaN
114     CARPENTER Phil          1  NaN  NaN    NaN         NaN          NaN

[115 rows x 7 columns]

In [48]:
# Ordenado por 2 columnas
df_diamonds.sort_values(["world_champ", "victories"])

                name  victories   2nd   3rd  poles fastest_lap  world_champ
69          MIR Joan          1   4.0   6.0    NaN           1          1.0
44      HAYDEN Nicky          3   6.0  19.0    5.0           7          1.0
39   LIBERATI Libero          4   3.0   1.0    NaN           1          1.0
33     GRAHAM Leslie          5   3.0   NaN    NaN           6          1.0
35     UNCINI Franco          5   1.0   5.0    1.0           1          1.0
..               ...        ...   ...   ...    ...         ...          ...
24  VIÑALES Maverick          9   7.0  12.0   13.0          10          NaN
19        BIAGGI Max         13  26.0  19.0   23.0          14          NaN
20      MAMOLA Randy         13  22.0  19.0    5.0          12          NaN
17  DOVIZIOSO Andrea         15  21.0  26.0    7.0          11          NaN
7       PEDROSA Dani         31  40.0  41.0   31.0          44          NaN

[115 rows x 7 columns]

#### Agrupaciones con groupby y visualizarla

In [49]:
df_diamonds["name"].unique()

array(['ROSSI Valentino', 'AGOSTINI Giacomo', 'MARQUEZ Marc',
       'DOOHAN Mick', 'LORENZO Jorge', 'STONER Casey', 'HAILWOOD Mike',
       'PEDROSA Dani', 'LAWSON Eddie', 'SCHWANTZ Kevin', 'RAINEY Wayne',
       'ROBERTS Kenny', 'DUKE Geoff', 'SURTEES John', 'SPENCER Freddie',
       'SHEENE Barry', 'GARDNER Wayne', 'DOVIZIOSO Andrea',
       'CRIVILLE Alex', 'BIAGGI Max', 'MAMOLA Randy', 'READ Phil',
       'CAPIROSSI Loris', 'GIBERNAU Sete', 'VIÑALES Maverick',
       'CADALORA Luca', 'ROBERTS JR Kenny', 'HOCKING Gary', 'BARROS Alex',
       'QUARTARARO Fabio', 'LUCCHINELLI Marco', 'MASETTI Umberto',
       'MELANDRI Marco', 'GRAHAM Leslie', 'HARTOG Wil', 'UNCINI Franco',
       'OKADA Tadayuki', 'KOCINSKI John', 'ARMSTRONG Reg',
       'LIBERATI Libero', 'HARTLE John', 'FINDLAY Jack', 'BEATTIE Daryl',
       'PAGANI Alberto', 'HAYDEN Nicky', 'CRUTCHLOW Cal', 'RINS Alex',
       'HENNEN Pat', 'ABE Norick', 'MILANI Alfredo', 'CECOTTO Johnny',
       'MILLER Jack', 'OLIVEIRA Miguel', 'MCCOY Garry',
       'MORBIDELLI Franco', 'CHECA Carlos', 'FERRARI Virginio',
       'PETRUCCI Danilo', 'AMM Ray', 'PAGANI Nello', 'TAMADA Makoto',
       'MIDDELBURG Jack', 'ANDERSON Fergus', 'SAARINEN Jarno',
       'BINDER Brad', 'REDMAN Jim', 'VENTURI Remo', 'LANSIVUORI Teuvo',
       'MCINTYRE Bob', 'MIR Joan', 'KAVANAGH Ken', 'SHEPHERD Alan',
       'BERGAMONTI Angelo', 'SARRON Christian', 'KATAYAMA Takazumi',
       'VERMEULEN Chris', 'BONERA Gianfranco', 'DORAN William',
       'IANNONE Andrea', 'UKAWA Tohru', 'SPIES Ben', 'ELIAS Toni',
       'BRETT Jack', 'DALE Dickie', 'KANAYA Hideo', 'SIMMONDS Dave',
       'VAN DULMEN Boet', 'AHEARN Jack', 'NEWCOMBE Kim',
       'MONNERET Pierre', 'MORTIMER Chas', 'CRAFAR Simon',
       'CALDARELLA Benedicto', 'WILLIAMS John', 'CHILI Pierfrancesco',
       'NEWBOLD John', 'CREITH R.', 'KISSLING Jorge', 'PUIG Alberto',
       'BAYLISS Troy', 'STASTNY Franta', 'MARTIN Jorge', 'MAGEE Kevin',
       'HERRON Tom', 'LACONI Regis', 'GRANT Mike', 'LOMAS Bill',
       'NASH Godfrey', 'DANIELL Harold', 'MCCANDLESS Cromie',
       'FRUTSCHI Michel', 'CZIHAK Edmund', 'COLNAGO Giuseppe', nan,
       'CARPENTER Phil'], dtype=object)

In [50]:
df_diamonds.groupby(by = "name").max()

                  victories   2nd   3rd  poles fastest_lap  world_champ
name
ABE Norick                3   4.0  10.0    NaN           1          NaN
AGOSTINI Giacomo         68  20.0   NaN    6.0          69          8.0
AHEARN Jack               1   1.0   5.0    NaN         NaN          NaN
AMM Ray                   2   3.0   2.0    NaN           3          NaN
ANDERSON Fergus           2   1.0   NaN    NaN           2          NaN
...                     ...   ...   ...    ...         ...          ...
VAN DULMEN Boet           1   2.0   1.0    1.0         NaN          NaN
VENTURI Remo              1   9.0   1.0    NaN           2          NaN
VERMEULEN Chris           1   3.0   3.0    3.0           1          NaN
VIÑALES Maverick          9   7.0  12.0   13.0          10          NaN
WILLIAMS John             1   1.0   1.0    NaN           1          NaN

[114 rows x 6 columns]

In [51]:
df_diamonds.groupby(by = "name").aggregate(["min", "max"])

                 victories       2nd         3rd       poles        \
                       min max   min   max   min   max   min   max
name
ABE Norick               3   3   4.0   4.0  10.0  10.0   NaN   NaN
AGOSTINI Giacomo        68  68  20.0  20.0   NaN   NaN   6.0   6.0
AHEARN Jack              1   1   1.0   1.0   5.0   5.0   NaN   NaN
AMM Ray                  2   2   3.0   3.0   2.0   2.0   NaN   NaN
ANDERSON Fergus          2   2   1.0   1.0   NaN   NaN   NaN   NaN
...                    ...  ..   ...   ...   ...   ...   ...   ...
VAN DULMEN Boet          1   1   2.0   2.0   1.0   1.0   1.0   1.0
VENTURI Remo             1   1   9.0   9.0   1.0   1.0   NaN   NaN
VERMEULEN Chris          1   1   3.0   3.0   3.0   3.0   3.0   3.0
VIÑALES Maverick         9   9   7.0   7.0  12.0  12.0  13.0  13.0
WILLIAMS John            1   1   1.0   1.0   1.0   1.0   NaN   NaN

                 fastest_lap      world_champ
                         min  max         min  max
name
ABE Norick                 1    1         NaN  NaN
AGOSTINI Giacomo          69   69         8.0  8.0
AHEARN Jack              NaN  NaN         NaN  NaN
AMM Ray                    3    3         NaN  NaN
ANDERSON Fergus            2    2         NaN  NaN
...                      ...  ...         ...  ...
VAN DULMEN Boet          NaN  NaN         NaN  NaN
VENTURI Remo               2    2         NaN  NaN
VERMEULEN Chris            1    1         NaN  NaN
VIÑALES Maverick          10   10         NaN  NaN
WILLIAMS John              1    1         NaN  NaN

[114 rows x 12 columns]